<!-- dflook/terraform-github-actions {"workspace":"staging","backend":"c048519182a976c341d4d2a42680e5ffc5ef15cda9145316e6136dd47f3245ec","backend_type":"s3","label":"staging","plan_job_ref":"Job plan #243 at https://github.com/GSA/datagov-ssb/actions/runs/2905231515","plan_hash":"dabd876275bed45cd849efe56d4b702c165bec96efd2b854916b68c30d8745ee","plan_text_format":"text"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-F678F1CE"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-F678F1CE"
      ~ value          = 1000 -> 20
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_instance.solrcloud_broker_k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "solrcloud_broker_k8s_cluster" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + mng_desired_capacity = 1
              + mng_instance_types   = [
                  + "t2.small",
                ]
              + mng_max_capacity     = 1
              + mng_min_capacity     = 1
            }
        )
      + name                           = "ssb-solrcloud-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "75ff550a-1f72-4bc2-9bd9-644a174a3384"
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "60m"
          + delete = "40m"
          + update = "90m"
        }
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "992b3308-380f-404b-a06f-a723f03d963a"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ source_code_hash           = "Rk8mSZXh0vqJ32RuZfoOwCF7uzDQhzblzXMzhO4i5uk=" -> "D7XQEUsUbwn8LAFxzDIJzK9HErmRWt3om52Ac+2zYf8="
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "1b91bff2-130f-41d5-8295-574780d974ec"
        name                             = "ssb-eks-gsa-datagov-management-staging"
        # (8 unchanged attributes hidden)
    }

  # module.broker_solrcloud.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "ddef884b-c4dd-4a89-9ee5-aa0f5ea3cabf"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solrcloud"
        # (19 unchanged attributes hidden)

      + service_binding {
          + service_instance = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #243](https://github.com/GSA/datagov-ssb/actions/runs/2905231515)